//Выведите в консоль слово "Привет" два раза. Каждое слово должно начинаться с новой.
public class Main {

    public static void main(String[] args) {
        System.out.println("Привет");
        System.out.println("Привет");
    }
}

